app/Models/MembreModel.php

    public function checkMembre($postData){
        $mail = $postData['pseudomail'];
        $where = "email='{$mail}' OR pseudo='{$mail}'";
        $membre = $this->where(new RawSql($where))
                     ->get()
                     ->getRowArray();
---
SELECT *
FROM `membre`
WHERE email='MartineLapine' OR pseudo='MartineLapine'