app/Models/RecetteModel.php

INSERT INTO `recette_tag` (`id_tag`, `id_recette`) VALUES ('5', 33)
---
    public function addRecette($postData){
        $this-> insert($postData);

        $idRecette =  $this->db->insertID();

        foreach($postData['tagEnvoi'] as $idTag){
            $insert = array(
                'id_tag' => $idTag,
                'id_recette' => $idRecette
            );
            $this->db->table('recette_tag')
                     ->insert($insert);

SELECT `id_recette`, `id_tag`, `recette`.`id`, `titre`, `description`, `image`, `difficulte`, `nbPart`, `duree`, `ingredient`, `etape`, `membre_id`, `categorie_id`, `sousCategorie_id`, `membre`.`id` as `idMembre`, `pseudo`
FROM `recette_tag`
JOIN `recette` ON `recette`.`id` = `recette_tag`.`id_recette`
JOIN `membre` ON `membre`.`id` = `recette`.`membre_id`
WHERE `id_tag` = '15'
---
    public function getRecetteByTagId($tagId){

        $query = $this  ->db->table('recette_tag')
                        -> select('id_recette, id_tag, recette.id, titre, description, image, difficulte, nbPart, duree,    ingredient, etape, membre_id, categorie_id, sousCategorie_id, membre.id as idMembre, pseudo,')
                        ->where('id_tag', $tagId)
                        ->join('recette', 'recette.id = recette_tag.id_recette')
                        ->join ('membre', 'membre.id = recette.membre_id')
                        ->get()
                        ->getResultArray();