app/Models/TagModel.php

    public function getTag(){

        // on recupère les id_tags qui sont associés avec id_recette dans la table de jointure
        // groupBy permet de récuperer 1 seul id même si celui-ci se répète
        $tagIds = array_values($this->db->table('recette_tag')
                 ->select('id_tag')
                 ->groupBy('id_tag')
                 ->get()
                 ->getResultArray());
---
SELECT `id_tag`
FROM `recette_tag`
GROUP BY `id_tag`